#### Terraform working directory 🏠: `demo/demo-account/demo-application/resources`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ebs_volume.this["/dev/sda"] will be created
  + resource "aws_ebs_volume" "this" {
      + arn               = (known after apply)
      + availability_zone = "ap-southeast-1a"
      + encrypted         = true
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 40
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "ansible-testhost5/sda"
        }
      + tags_all          = {
          + "Name" = "ansible-testhost5/sda"
        }
      + throughput        = (known after apply)
      + type              = "gp3"
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ebs_volume.this["maersk-sda"] will be destroyed
  # (because key ["maersk-sda"] is not in for_each map)
  - resource "aws_ebs_volume" "this" {
      - arn                  = "arn:aws:ec2:ap-southeast-1:129980683758:volume/vol-08943946ded6b6729" -> null
      - availability_zone    = "ap-southeast-1a" -> null
      - encrypted            = true -> null
      - final_snapshot       = false -> null
      - id                   = "vol-08943946ded6b6729" -> null
      - iops                 = 3000 -> null
      - kms_key_id           = "arn:aws:kms:ap-southeast-1:129980683758:key/6dc66ab3-fb16-4eb2-8a7a-5be1bee5e2ee" -> null
      - multi_attach_enabled = false -> null
      - size                 = 40 -> null
      - tags                 = {
          - "Name" = "maersk-sda"
        } -> null
      - tags_all             = {
          - "Name" = "maersk-sda"
        } -> null
      - throughput           = 125 -> null
      - type                 = "gp3" -> null
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.rbd["GroupName"] will be destroyed
  # (because key ["GroupName"] is not in for_each map)
  - resource "aws_ec2_tag" "rbd" {
      - id          = "vol-08a7b1dc2f51dcece,GroupName" -> null
      - key         = "GroupName" -> null
      - resource_id = "vol-08a7b1dc2f51dcece" -> null
      - value       = "root" -> null
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.rbd["Mountpoint"] will be destroyed
  # (because key ["Mountpoint"] is not in for_each map)
  - resource "aws_ec2_tag" "rbd" {
      - id          = "vol-08a7b1dc2f51dcece,Mountpoint" -> null
      - key         = "Mountpoint" -> null
      - resource_id = "vol-08a7b1dc2f51dcece" -> null
      - value       = "/" -> null
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.rbd["Name"] will be updated in-place
  ~ resource "aws_ec2_tag" "rbd" {
        id          = "vol-08a7b1dc2f51dcece,Name"
      ~ value       = "ansible-testhost5/root/0" -> "ansible-testhost5/root"
        # (2 unchanged attributes hidden)
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_volume_attachment.this["/dev/sda"] will be created
  + resource "aws_volume_attachment" "this" {
      + device_name = "/dev/sda"
      + id          = (known after apply)
      + instance_id = "i-0a6f3247805e75f3d"
      + volume_id   = (known after apply)
    }

Plan: 2 to add, 1 to change, 3 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
